# [결측치 Missing Value 처리]
- 데이터 미입력 또는 데이터 저장 과정에서 지워진 데이터
- 빈칸 의미
- 표시 : NaN (Not A Number) NaT (Not A Text)
- 표현 : numpy.nan, math.nan을 사용

## <hr>(1) 모듈 로딩

In [1]:
 import pandas as pd

## <hr>(2) 데이터 준비

In [2]:
file = "../DATA/employees.csv"

## <hr>(3) 데이터 저장 : CSV => DF

In [3]:
# 구분자:, 헤더: 첫번째 줄 컬럼명
empDF = pd.read_csv(file)

In [4]:
# 데이터의 전반적인 요약정보 확인 => info() 메서드
# - 컬럼별 결측치 여부 확인 => 결측치 처리
# - 타입이 다른 경우, 타입 변환 => 타입 다른 경우, 타입 변환
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [5]:
# 데이터의 컬럼별 분포 확인 => describe()
empDF.describe()

              Salary
count     999.000000
mean    90655.528529
std     32939.511615
min     35013.000000
25%     62560.000000
50%     90427.000000
75%    118744.500000
max    149908.000000

In [7]:
# 최빈값 중앙값
print(empDF.mode(numeric_only=True), empDF.median(numeric_only=True), empDF.mean(numeric_only=True), sep = "\n\n\n\n")

     Salary
0   86676.0
1   91462.0
2  121160.0
3  145988.0
4  147183.0



Salary    90427.0
dtype: float64



Salary    90655.528529
dtype: float64

## <hr>(5) 결측값, 이상치, 특이값 처리 -> 제거/치환<br>
- 나이 : -4살<br>
- 혈액형 : p형<br>
- 중복데이터<br>
- 누락데이터<br>

In [14]:
# 결측치 => isna(), isnull() : 원소 단위로 검사 후 결측치인 경우 True 반환

print(empDF.isna().head(), empDF.isnull().head(), sep="\n\n\n")

   First Name  Gender  Start Date  Salary   Mgmt   Team
0       False   False       False    True  False  False
1       False   False       False   False  False   True
2       False   False        True   False  False  False
3       False    True       False   False  False  False
4       False   False       False   False  False  False


   First Name  Gender  Start Date  Salary   Mgmt   Team
0       False   False       False    True  False  False
1       False   False       False   False  False   True
2       False   False        True   False  False  False
3       False    True       False   False  False  False
4       False   False       False   False  False  False

In [16]:
# 결측치 개수
print(empDF.isna().sum(), empDF.isnull().sum(), sep="\n\n\n")

First Name     68
Gender        147
Start Date      2
Salary          2
Mgmt           68
Team           44
dtype: int64


First Name     68
Gender        147
Start Date      2
Salary          2
Mgmt           68
Team           44
dtype: int64

In [17]:
# 결측치 체크 ==> notna() / notnull() : 결측치가 아니면 True -> 정상 데이터 체크 가능
print(empDF.notna().head(), empDF.notnull().head(), sep="\n\n\n")

   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True


   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True

### 결측치 처리 ==> (1) 삭제 : dropna()

In [20]:
# 모든 행에 1개의 값이라도 NaN이면 행 자체 삭
empDF2 = empDF.dropna()

print(empDF.shape, empDF2.shape)

(1001, 6) (761, 6)

In [22]:
# 행에 모든(all) 데이터 즉 값이 NA면 삭제
empDF3 = empDF.dropna(how="all") 

print(empDF.shape, empDF3.shape)

(1001, 6) (1000, 6)

In [25]:
# 성별과 연봉을 보고 싶은데, 만약 성별과 연봉 중 하나라도 삐꾸면 삭제 나머지는 알 바 아님 
empDF4 = empDF.dropna(subset=("Gender", "Salary"))
empDF4

    First Name  Gender Start Date    Salary   Mgmt          Team
1       Thomas    Male    3/31/96   61933.0   True           NaN
2        Maria  Female        NaN  130590.0  False       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
6         Ruby  Female    8/17/87   65476.0   True       Product
..         ...     ...        ...       ...    ...           ...
994     George    Male    6/21/13   98874.0   True     Marketing
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev
999     Albert    Male    5/15/12  129949.0   True         Sales

[853 rows x 6 columns]

In [27]:
empDF5 = empDF.dropna(thresh=950, axis=1) # 데이터가 최소 몇개는 되어야한다~
empDF5

     Start Date    Salary          Team
0        8/6/93       NaN     Marketing
1       3/31/96   61933.0           NaN
2           NaN  130590.0       Finance
3        3/4/05  138705.0       Finance
4       1/24/98  101004.0            IT
...         ...       ...           ...
996     1/31/84   42392.0       Finance
997     5/20/13   96914.0       Product
998     4/20/13   60500.0  Business Dev
999     5/15/12  129949.0         Sales
1000        NaN       NaN           NaN

[1001 rows x 3 columns]

### 결측치 처리 ==> (2) 대체 : fillna()

In [29]:
# Gender 컬럼에 결측 값을 무엇으로 채울까?
empDF.describe(include="all")

       First Name  Gender Start Date         Salary  Mgmt Team
count         933     854        999     999.000000   933  957
unique        200       2        971            NaN     2   10
top       Marilyn  Female   10/30/04            NaN  True   IT
freq           11     431          2            NaN   468  106
mean          NaN     NaN        NaN   90655.528529   NaN  NaN
std           NaN     NaN        NaN   32939.511615   NaN  NaN
min           NaN     NaN        NaN   35013.000000   NaN  NaN
25%           NaN     NaN        NaN   62560.000000   NaN  NaN
50%           NaN     NaN        NaN   90427.000000   NaN  NaN
75%           NaN     NaN        NaN  118744.500000   NaN  NaN
max           NaN     NaN        NaN  149908.000000   NaN  NaN

In [33]:
# 최빈값으로 채우기
m = empDF.Gender.mode()[0]
m

'Female'

In [37]:
genSR = empDF.Gender.fillna(m)

In [38]:
genSR.isna().sum() # 결측치 사라진 거 확인!!

0

In [40]:
# NA 이전 이후 값으로 채우기 ffill, bfill
empDF.Gender.fillna(method='ffill')

0         Male
1         Male
2       Female
3       Female
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000      Male
Name: Gender, Length: 1001, dtype: object

In [45]:
import numpy as np
import numpy as np
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, np.nan],
                    [np.nan, 3, np.nan, 4]],
                   columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [46]:
df.A.fillna(method="ffill", limit=1)

0    NaN
1    3.0
2    3.0
3    NaN
Name: A, dtype: float64

In [ ]:
# 평균값은 df.col.mean()